## ex07-Aggregating data with GROUP BY and ORDER BY

The ***GROUP BY*** clause is an optional clause of the SELECT statement. The GROUP BY clause a selected group of rows into summary rows by values of one or more columns. 

The GROUP BY clause returns one row for each group. For each group, you can apply an aggregate function such as ***MIN, MAX, SUM, COUNT, or AVG*** to provide more information about each group.

In [1]:
%load_ext sql

### 1. Connet to the given database of demo.db3

In [2]:
%sql sqlite:///data/demo.db3

u'Connected: @data/demo.db3'

If you do not remember the tables in the demo data, you can always use the following command to query.

In [3]:
%sql SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///data/demo.db3
Done.

[(u'rch',),
 (u'hru',),
 (u'sub',),
 (u'sed',),
 (u'watershed_daily',),
 (u'watershed_monthly',),
 (u'watershed_yearly',),
 (u'channel_dimension',),
 (u'hru_info',),
 (u'sub_info',),
 (u'rch_info',),
 (u'ave_plant',),
 (u'ave_annual_hru',),
 (u'ave_monthly_basin',),
 (u'ave_annual_basin',)]

### 2. Grouping data

Take the table of ***rch*** as an example

#### 2.1 Check the table colums firstly.

In [4]:
%sql SELECT * From rch LIMIT 3

 * sqlite:///data/demo.db3
Done.

[(1, 1981, 1, 146.34376525878906, 146.2524871826172, 0.09128088504076004, 0.0, 2.3320461650655488e-07, 61619.46484375, 155.3719024658203, 0.016086287796497345, 0.0, 0.04825887829065323, 0.0, 362.0486755371094, 361.8135070800781, 203.620849609375, 421.18377685546875, 0.0, 23.0184326171875, 0.016107244417071342, 0.0, 1.1839052307949238e-11, 0.0, 0.0, 0.0, 5627225.0, 5623486.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 806.0157470703125, 0.0, 0.0, 0.0),
 (2, 1981, 1, 96.22569274902344, 96.18285369873047, 0.042821284383535385, 0.0, 1.6426764659627224e-07, 0.0, 0.0, 0.01363153662532568, 0.0, 0.04089462012052536, 0.0, 315.60052490234375, 315.4579772949219, 0.0, 127.00502014160156, 0.0, 0.0, 0.013656049966812134, 0.0, 4.136972177163251e-16, 0.0, 0.0, 0.0, 3757606.5, 3698301.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 442.4630126953125, 0.0, 0.0, 0.0),
 (3, 1981, 1, 11.952718734741211, 11.861368179321289, 0.09135182946920395, 0.0, 2.0325823868461157e-07, 2.0325823868461157e-07, 6.595060941805286e-09, 0.01146628800779581, 0.0, 0.03439886122941971, 0.009118038229644299, 48.2963752746582, 47.93150329589844, 0.0, 62.467620849609375, 0.0, 0.0, 0.011485105380415916, 0.0, 5.941028783295818e-14, 0.0, 0.0, 0.0, 360979.90625, 456115.90625, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 110.39912414550781, 0.009118038229644299, 0.0, 0.0)]

#### 2.2 Check unique values

Firstly, let's have a look at the number of RCH. We can use the ***DISTINCT*** keyword in conjunction with SELECT statement to eliminate all the duplicate records and fetching only the unique records.

In [5]:
%%sql sqlite://
SELECT COUNT(DISTINCT RCH) AS nRCH
FROM rch

Done.

[(23,)]

We also can use the ***GROUP BY*** clause to get back a cleaner output, with fewer rows – only unique values returned.

In [6]:
%%sql sqlite://
SELECT RCH
FROM rch
GROUP BY RCH

Done.

[(1,),
 (2,),
 (3,),
 (4,),
 (5,),
 (6,),
 (7,),
 (8,),
 (9,),
 (10,),
 (11,),
 (12,),
 (13,),
 (14,),
 (15,),
 (16,),
 (17,),
 (18,),
 (19,),
 (20,),
 (21,),
 (22,),
 (23,)]

#### 2.3 Use aggregate  functions on Groups

We can get more details trough aggregating data on group than on whole columns.

In [7]:
%%sql sqlite://
SELECT RCH, AVG(FLOW_INcms), AVG(FLOW_OUTcms)
FROM rch
GROUP BY RCH

Done.

[(1, 631.8990093310674, 629.7380514648225),
 (2, 333.0202187087801, 332.79249324997267),
 (3, 152.36708157062532, 151.58638913697666),
 (4, 270.92289432916374, 270.5829954958624),
 (5, 933.1512839211358, 921.7582115385268),
 (6, 2700.088200208876, 2697.8029292848373),
 (7, 69.64315097878377, 68.53229562627091),
 (8, 1784.046529504988, 1776.2703920046488),
 (9, 1689.8438427501255, 1688.7743001672957),
 (10, 233.96010857224465, 233.50774793492423),
 (11, 1626.5236574543846, 1614.5366679032643),
 (12, 595.4463993251323, 594.3839241716597),
 (13, 485.0579067746798, 484.5191706750128),
 (14, 218.49423703187043, 218.45375338461665),
 (15, 78.63512668444051, 76.14785773319956),
 (16, 281.7426873054769, 280.69021704279714),
 (17, 37.79267790690064, 37.704887457564475),
 (18, 134.39293413791393, 133.76857711888022),
 (19, 84.25120316512054, 84.1577095127768),
 (20, 150.6475102369984, 150.41951570461194),
 (21, 65.17107435870501, 65.10127843287256),
 (22, 240.03635869224865, 238.23909225828118),
 (23, 68.185183768885, 67.95374260288146)]

### 3. Order/Sort Records

Firstly, let us check the years and months with the maximum FLOW_INcms

In [8]:
%%sql sqlite://
SELECT RCH, YR, MO, MAX(FLOW_INcms)
FROM rch
GROUP BY RCH

Done.

[(1, 1997, 7, 3758.952392578125),
 (2, 1997, 7, 1820.2337646484375),
 (3, 1981, 5, 871.1177368164062),
 (4, 1997, 7, 1919.5400390625),
 (5, 1997, 7, 3961.945068359375),
 (6, 1992, 6, 10503.7236328125),
 (7, 1992, 3, 352.1608581542969),
 (8, 1994, 5, 7693.54345703125),
 (9, 1994, 5, 7507.53515625),
 (10, 2010, 5, 1513.6510009765625),
 (11, 1994, 5, 7375.59814453125),
 (12, 2010, 5, 3167.544921875),
 (13, 1997, 6, 3291.47900390625),
 (14, 1997, 6, 1798.0953369140625),
 (15, 2010, 2, 445.2956848144531),
 (16, 1999, 5, 1628.8758544921875),
 (17, 1995, 6, 226.17861938476562),
 (18, 1997, 6, 1161.7515869140625),
 (19, 1997, 6, 637.0214233398438),
 (20, 1996, 6, 1081.8587646484375),
 (21, 1997, 6, 590.9754638671875),
 (22, 1997, 6, 1428.43603515625),
 (23, 1997, 6, 604.881103515625)]

It is obvious that the year and month columns are not in a natural sort. This is a good time to bring up the ***ORDER BY*** operator, which you can put at the end of a SQL state‐ment (after any WHERE and GROUP BY). We can sort the query results by year, and then month.

In [9]:
%%sql sqlite://
SELECT RCH, YR, MO, ROUND(MAX(FLOW_INcms),2)
FROM rch
GROUP BY RCH
ORDER BY YR, MO

Done.

[(3, 1981, 5, 871.12),
 (7, 1992, 3, 352.16),
 (6, 1992, 6, 10503.72),
 (8, 1994, 5, 7693.54),
 (9, 1994, 5, 7507.54),
 (11, 1994, 5, 7375.6),
 (17, 1995, 6, 226.18),
 (20, 1996, 6, 1081.86),
 (13, 1997, 6, 3291.48),
 (14, 1997, 6, 1798.1),
 (18, 1997, 6, 1161.75),
 (19, 1997, 6, 637.02),
 (21, 1997, 6, 590.98),
 (22, 1997, 6, 1428.44),
 (23, 1997, 6, 604.88),
 (1, 1997, 7, 3758.95),
 (2, 1997, 7, 1820.23),
 (4, 1997, 7, 1919.54),
 (5, 1997, 7, 3961.95),
 (16, 1999, 5, 1628.88),
 (15, 2010, 2, 445.3),
 (10, 2010, 5, 1513.65),
 (12, 2010, 5, 3167.54)]

By default, sorting is done with the ***ASC*** operator, which orders the data in ascending order. We can sort in descending order applying the ***DESC*** operatorhe.

In [10]:
%%sql sqlite://
SELECT RCH, YR, MO, ROUND(MAX(FLOW_INcms),2)
FROM rch
GROUP BY RCH
ORDER BY YR DESC, MO

Done.

[(15, 2010, 2, 445.3),
 (10, 2010, 5, 1513.65),
 (12, 2010, 5, 3167.54),
 (16, 1999, 5, 1628.88),
 (13, 1997, 6, 3291.48),
 (14, 1997, 6, 1798.1),
 (18, 1997, 6, 1161.75),
 (19, 1997, 6, 637.02),
 (21, 1997, 6, 590.98),
 (22, 1997, 6, 1428.44),
 (23, 1997, 6, 604.88),
 (1, 1997, 7, 3758.95),
 (2, 1997, 7, 1820.23),
 (4, 1997, 7, 1919.54),
 (5, 1997, 7, 3961.95),
 (20, 1996, 6, 1081.86),
 (17, 1995, 6, 226.18),
 (8, 1994, 5, 7693.54),
 (9, 1994, 5, 7507.54),
 (11, 1994, 5, 7375.6),
 (7, 1992, 3, 352.16),
 (6, 1992, 6, 10503.72),
 (3, 1981, 5, 871.12)]

### 4. Filter data on groups with the HAVING clause

Sometimes, we may want to filter out records based on a group or an aggregated value. While the first instinct might be to use a WHERE statement, this actually will not work because the WHERE filters records, and does not filter aggregations. For example, we try to use a WHERE to filter results where MAX(FLOW_INcms) is greater than 3000. This will get a sqlite3.OperationalError of misuse of aggregate.

In [11]:
%%sql sqlite://
SELECT RCH, YR, MO, MAX(FLOW_INcms) as MAX_FLOWIN
FROM rch
WHERE MAX_FLOWIN > 3000.0
GROUP BY RCH
ORDER BY YR DESC, MO

(sqlite3.OperationalError) misuse of aggregate: MAX() [SQL: u'SELECT RCH, YR, MO, MAX(FLOW_INcms) as MAX_FLOWIN\nFROM rch\nWHERE MAX_FLOWIN > 3000.0\nGROUP BY RCH\nORDER BY YR DESC, MO']

Under such a case, we cab use the ***HAVING*** clause to specify a filter condition for a group or an aggregate. The HAVING clause is an optional clause of the SELECT statement. We often use the HAVING clause with the GROUP BY clause. The GROUP BY clause groups a set of rows into a set of summary rows or groups. Then the HAVING clause filters groups based on specified conditions. 

***It is worth noting that the HAVING clause must follow the GROUP BY cluase strictly.***

In [12]:
%%sql sqlite://
SELECT RCH, YR, MO, MAX(FLOW_INcms) as MAX_FLOWIN
FROM rch
GROUP BY RCH
HAVING MAX_FLOWIN > 3000.0
ORDER BY YR DESC, MO

Done.

[(12, 2010, 5, 3167.544921875),
 (13, 1997, 6, 3291.47900390625),
 (1, 1997, 7, 3758.952392578125),
 (5, 1997, 7, 3961.945068359375),
 (8, 1994, 5, 7693.54345703125),
 (9, 1994, 5, 7507.53515625),
 (11, 1994, 5, 7375.59814453125),
 (6, 1992, 6, 10503.7236328125)]

### Summary

In this notebook, we learned how to use the DISTINCT operator to get distinct results in our queries and eliminate duplicates.

Next, we learned how to aggregate and sort data using GROUP BY and ORDER BY. 

We also showed the power of the aggregate functions of SUM(), MAX(), MIN(), AVG(), and COUNT(). 

Furthermore, we used the HAVING clause to filter aggregated fields that can not be done with the WHERE clause.